name_dict = {
    "王力鸿": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    },
    "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    },
    "林俊杰": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    },
    "张学友": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1
    },
    "刘德华": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    }
}
print("全体员工当前信息如下：")
print(name_dict)

for key in name_dict:
    level = name_dict[key]["级别"]
    if level == 1:
        name_dict[key]["级别"] += 1
        name_dict[key]["工资"] += 1000

print("全体员工级别为1的员工完成升值加薪操作，操作后：")
print(name_dict)